In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.read_csv("/Users/shivasagar/Downloads/DATA_SCIENCE/Machine Learning/ML Live/untitled folder/Lesson 11 Classification Ex 1.csv")

In [3]:
df.head()

,Default,checkingstatus1,duration,history,purpose,amount,savings,employ,installment,status,...,residence,property,age,otherplans,housing,cards,job,liable,tele,foreign
0,0,A11,6,A34,A43,1169,A65,A75,4,A93,...,4,A121,67,A143,A152,2,A173,1,A192,A201
1,1,A12,48,A32,A43,5951,A61,A73,2,A92,...,2,A121,22,A143,A152,1,A173,1,A191,A201
2,0,A14,12,A34,A46,2096,A61,A74,2,A93,...,3,A121,49,A143,A152,1,A172,2,A191,A201
3,0,A11,42,A32,A42,7882,A61,A74,2,A93,...,4,A122,45,A143,A153,1,A173,2,A191,A201
4,1,A11,24,A33,A40,4870,A61,A73,3,A93,...,4,A124,53,A143,A153,2,A173,2,A191,A201

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 21 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Default          1000 non-null   int64
 1   checkingstatus1  1000 non-null   object
 2   duration         1000 non-null   int64
 3   history          1000 non-null   object
 4   purpose          1000 non-null   object
 5   amount           1000 non-null   int64
 6   savings          1000 non-null   object
 7   employ           1000 non-null   object
 8   installment      1000 non-null   int64
 9   status           1000 non-null   object
 10  others           1000 non-null   object
 11  residence        1000 non-null   int64
 12  property         1000 non-null   object
 13  age              1000 non-null   int64
 14  otherplans       1000 non-null   object
 15  housing          1000 non-null   object
 16  cards            1000 non-null   int64
 17  job              1000 non-null   object
 18  liable           1000 non-null   int64
 19  tele             1000 non-null   object
 20  foreign          1000 non-null   object
dtypes: int64(8), object(13)
memory usage: 164.2+ KB

In [5]:
df.shape

(1000, 21)

In [6]:
df.dtypes

Default             int64
checkingstatus1    object
duration            int64
history            object
purpose            object
amount              int64
savings            object
employ             object
installment         int64
status             object
others             object
residence           int64
property           object
age                 int64
otherplans         object
housing            object
cards               int64
job                object
liable              int64
tele               object
foreign            object
dtype: object

In [7]:
df_1 = df.select_dtypes(include=['int'])

In [8]:
df_1.head()

   Default  duration  amount  installment  residence  age  cards  liable
0        0         6    1169            4          4   67      2       1
1        1        48    5951            2          2   22      1       1
2        0        12    2096            2          3   49      1       2
3        0        42    7882            2          4   45      1       2
4        1        24    4870            3          4   53      2       2

In [9]:
var_list = df[['Default', 'duration','amount','installment', 'residence', 'age']]

In [10]:
var_list.head()

   Default  duration  amount  installment  residence  age
0        0         6    1169            4          4   67
1        1        48    5951            2          2   22
2        0        12    2096            2          3   49
3        0        42    7882            2          4   45
4        1        24    4870            3          4   53

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
train,test = train_test_split(var_list, test_size=.3, random_state=123)

In [13]:
from sklearn.linear_model import LogisticRegression

In [14]:
model = LogisticRegression()

In [15]:
model = model.fit(train.drop('Default', axis=1), train['Default'])

In [16]:
train.shape

(700, 6)

In [17]:
y_predict = model.predict(test.drop('Default', axis=1))

In [18]:
y_predict

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0])

In [19]:
tab = pd.crosstab(y_predict, test.Default)

In [20]:
tab

Default    0   1
row_0
0        187  84
1         13  16

In [21]:
accuracy = (187+16)/(187+16+13+84)

In [22]:
accuracy

0.6766666666666666